# Titanic Data set 

### predict the servived people based on their Age,Sex,Pclass & Fare

In [1]:
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt

__author__ = "Ahmad Shhadeh"
__email__ = "ashhadeh@yahoo.com"
__Date__ = "2019-07-01"

In [2]:
#df = pd.read_csv("salaries.csv")
df= pd.read_csv("C:/Users/User/Desktop/DSDJ/Examples/External/SLR/titanic.csv")

df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
target= df['Survived']

In [4]:
input_ds=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived'],axis='columns')
input_ds.head(2)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833

In [5]:
# as ML model working only on numbers ,will change the company ,degree & Jobs into numbers 
from sklearn.preprocessing import LabelEncoder
le_Sex=LabelEncoder()

In [6]:
# adding the new encoder to the input dataset 

input_ds['Sex_n'] = le_Sex.fit_transform(input_ds['Sex'])

# you can also map 
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})


input_ds.head(2)

   Pclass     Sex   Age     Fare  Sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0

In [7]:
input_ds=input_ds.drop(['Sex'],axis='columns')
input_ds.head(20)

    Pclass   Age     Fare  Sex_n
0        3  22.0   7.2500      1
1        1  38.0  71.2833      0
2        3  26.0   7.9250      0
3        1  35.0  53.1000      0
4        3  35.0   8.0500      1
5        3   NaN   8.4583      1
6        1  54.0  51.8625      1
7        3   2.0  21.0750      1
8        3  27.0  11.1333      0
9        2  14.0  30.0708      0
10       3   4.0  16.7000      0
11       1  58.0  26.5500      0
12       3  20.0   8.0500      1
13       3  39.0  31.2750      1
14       3  14.0   7.8542      0
15       2  55.0  16.0000      0
16       3   2.0  29.1250      1
17       2   NaN  13.0000      1
18       3  31.0  18.0000      0
19       3   NaN   7.2250      0

In [8]:
target.head(2)

0    0
1    1
Name: Survived, dtype: int64

In [9]:
# From the above data, we noticed that there 3rd rows has "NaN" on bedroom column 
# for that we have to take action before we proceed as all ML linear models work only with numbers

#There are different ways to handle the empty/Null record, and all depend on our understanding of the data and the requirement 
#For example below some of actions can take:
#1- Drop the complete row
#2- Replaced with 0
#3- Replaced with mean/median or mood
#4- ...etc 
 
#In our case to make it simple we are going to calculate the median use instead of NULL

In [10]:

# to find the median for bedrooms
import math
median_Age=input_ds.Age.median()
median_Age

28.0

In [11]:
#to replace teh new value with NULL will use fillna function 
input_ds.Age=df.Age.fillna(median_Age)

In [12]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

from sklearn.model_selection import train_test_split
# splitting the data into test & train to avoid any overfitting issue 
X_train, X_test, y_train, y_test = train_test_split(input_ds,target,test_size=0.2)

model.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [13]:
model.score(input_ds,target)

0.9349046015712682

In [14]:
input_ds.head(2)

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0

In [15]:
model.predict([[1,38,71,0]])

array([1], dtype=int64)